package com.ghy.yueplayer.bean;

/**
 * 歌词bean
 * http://lp.music.ttpod.com/lrc/down?artist=一次就好&title=杨宗纬
 */
public class LyricResultTtPod {


    /**
     * code : 1
     * data : {"lrc":"[00:01.028]一次就好 - 杨宗纬\n[00:02.378]词：陈曦\n[00:02.978]曲：董冬冬\n[00:03.778]\n[00:26.029]想看你笑\n[00:28.888]想和你闹\n[00:30.738]想拥你入我怀抱\n[00:36.538]上一秒红着脸在争吵\n[00:42.038]下一秒转身就能和好\n[00:48.389]不怕你哭\n[00:51.279]不怕你叫\n[00:53.329]因为你是我的骄傲\n[00:59.279]一双眼睛追着你乱跑\n[01:04.613]一颗心早已经准备好\n[01:16.268]一次就好我带你去看天荒地老\n[01:21.967]在阳光灿烂的日子里开怀大笑\n[01:27.568]在自由自在的空气里吵吵闹闹\n[01:32.919]你可知道我唯一的想要\n[01:38.569]世界还小我陪你去到天涯海角\n[01:44.519]在没有烦恼的角落里停止寻找\n[01:50.219]在无忧无虑的时光里慢慢变老\n[01:55.520]你可知道我全部的心跳\n[02:00.824]随你跳\n[02:10.517]\n[02:24.517]想看你笑\n[02:27.269]想和你闹\n[02:29.370]想拥你入我怀抱\n[02:35.020]上一秒红着脸在争吵\n[02:40.730]下一秒转身就能和好\n[02:47.031]不怕你哭\n[02:49.831]不怕你叫\n[02:51.881]因为你是我的骄傲\n[02:57.881]一双眼睛追着你乱跑\n[03:03.253]一颗心早已经准备好\n[03:14.653]一次就好我带你去看天荒地老\n[03:20.553]在阳光灿烂的日子里开怀大笑\n[03:26.154]在自由自在的空气里吵吵闹闹\n[03:31.504]你可知道我唯一的想要\n[03:37.104]世界还小我陪你去到天涯海角\n[03:43.105]在没有烦恼的角落里停止寻找\n[03:48.805]在无忧无虑的时光里慢慢变老\n[03:57.156]你可知道我全部的心跳\n[04:04.560]随你跳\n"}
     */

    private int code;
    private DataBean data;

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public DataBean getData() {
        return data;
    }

    public void setData(DataBean data) {
        this.data = data;
    }

    public static class DataBean {
        /**
         * lrc : [00:01.028]一次就好 - 杨宗纬
         * [00:02.378]词：陈曦
         * [00:02.978]曲：董冬冬
         * [00:03.778]
         * [00:26.029]想看你笑
         * [00:28.888]想和你闹
         * [00:30.738]想拥你入我怀抱
         * [00:36.538]上一秒红着脸在争吵
         * [00:42.038]下一秒转身就能和好
         * [00:48.389]不怕你哭
         * [00:51.279]不怕你叫
         * [00:53.329]因为你是我的骄傲
         * [00:59.279]一双眼睛追着你乱跑
         * [01:04.613]一颗心早已经准备好
         * [01:16.268]一次就好我带你去看天荒地老
         * [01:21.967]在阳光灿烂的日子里开怀大笑
         * [01:27.568]在自由自在的空气里吵吵闹闹
         * [01:32.919]你可知道我唯一的想要
         * [01:38.569]世界还小我陪你去到天涯海角
         * [01:44.519]在没有烦恼的角落里停止寻找
         * [01:50.219]在无忧无虑的时光里慢慢变老
         * [01:55.520]你可知道我全部的心跳
         * [02:00.824]随你跳
         * [02:10.517]
         * [02:24.517]想看你笑
         * [02:27.269]想和你闹
         * [02:29.370]想拥你入我怀抱
         * [02:35.020]上一秒红着脸在争吵
         * [02:40.730]下一秒转身就能和好
         * [02:47.031]不怕你哭
         * [02:49.831]不怕你叫
         * [02:51.881]因为你是我的骄傲
         * [02:57.881]一双眼睛追着你乱跑
         * [03:03.253]一颗心早已经准备好
         * [03:14.653]一次就好我带你去看天荒地老
         * [03:20.553]在阳光灿烂的日子里开怀大笑
         * [03:26.154]在自由自在的空气里吵吵闹闹
         * [03:31.504]你可知道我唯一的想要
         * [03:37.104]世界还小我陪你去到天涯海角
         * [03:43.105]在没有烦恼的角落里停止寻找
         * [03:48.805]在无忧无虑的时光里慢慢变老
         * [03:57.156]你可知道我全部的心跳
         * [04:04.560]随你跳
         */

        private String lrc;

        public String getLrc() {
            return lrc;
        }

        public void setLrc(String lrc) {
            this.lrc = lrc;
        }
    }
}
